/*


 интерфейс экрана выполнения задания

 1. имеет props
      - показывать ячейку 'откуда'
      - показывать пошаговое задание и следующий шаг
      - показывать ячейку 'куда'


 2. имеет состояние
      - выбранная/последняя ячейка 'откуда'
      - пошаговое задание / порядок выполнения - с первого
      - выбранная/последняя ячейка 'куда'

 3. обработчик поступающих штрих-кодов

 4. рендер

    шапка задания
     - тип задания
     - кто выполняет
     - прогресс %

    ячейка 'откуда'

    ячейка 'куда'

    взятый товар/паллета
    
    очередное пошаговое задание













 */
